pinpush-tech/ppbms-ce/boot/soc/n32g43x/eide/.pack/Nationstech/N32G43x_DFP.1.1.0/Nationstech.N32G43x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.0" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Nationstech</vendor>
    <url>http://www.keil.com/pack/</url>
    <name>N32G43x_DFP</name>

    <description>Nationstech N32G43x Series Device Support, Drivers and Examples</description>

    <releases>
	    <release version="1.1.0">
            Update TIM1 and TIM8 in the svd file.
			Modify Dvendor.
        </release>
		<release version="1.0.0">
            Add “IRAM2” to all devices.
			Delete TSC module.
        </release>
		<release version="0.9.6">
            Update the alglrithm for flash programming.
        </release>
        <release version="0.9.3">
            Add The Device N32G435T8Q7.
        </release>
		<release version="0.9.1">
            Add The Device N32G435GBQ7.
        </release>
        <release version="0.1.1">
            Delete package message.
        </release>
        <release version="0.1.0">
            Alpha version of N32G43x Device Family Pack.
        </release>
    </releases>

    <keywords>
        <keyword>Nationstech</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G43x</keyword>
        <keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G43x Series" Dvendor="Nationstech:184">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
            <description>
            </description>

            <subFamily DsubFamily="N32G432">
                <description>
Up to 108MHz ARM Cortex-M4F, 128KB Flash, 32KB SRAM, 52xGPIO(MAX), 9xTimer, RTC, 28xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 5xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xCAN 2.0B, 1xDMA Hardware Cryptographic Engine.
                </description>
                <processor Dclock="108000000"/>
                <compile header="firmware/CMSIS/device/n32g43x.h" define="N32G43X N32G432 USE_STDPERIPH_DRIVER"/>

	
<device Dname="N32G432K8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   24KB&#xA;&#xD;
- I/O:    26&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    14&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x4000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G432.svd"/>
</device>


<device Dname="N32G432KB">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   32KB&#xA;&#xD;
- I/O:    26&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    14&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x6000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G432.svd"/>
</device>


<device Dname="N32G432C8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   24KB&#xA;&#xD;
- I/O:    38&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x4000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G432.svd"/>
</device>


<device Dname="N32G432CB">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   32KB&#xA;&#xD;
- I/O:    38&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x6000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G432.svd"/>
</device>


<device Dname="N32G432R8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   24KB&#xA;&#xD;
- I/O:    52&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    28&#xA;&#xD;
- ADC:    1x12bit with 16 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x4000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G432.svd"/>
</device>


<device Dname="N32G432RB">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   32KB&#xA;&#xD;
- I/O:    52&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    28&#xA;&#xD;
- ADC:    1x12bit with 16 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x6000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G432.svd"/>
</device>

            </subFamily>

            <subFamily DsubFamily="N32G435">
                <description>
Up to 108MHz ARM Cortex-M4F, 128KB Flash, 32KB SRAM, 52xGPIO(MAX), 9xTimer, RTC, 28xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 2xOPAMP, 2xCOMP, 5xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xCAN 2.0B, 1xDMA Hardware Cryptographic Engine.
                </description>
                <processor Dclock="108000000"/>
                <compile header="firmware/CMSIS/device/n32g43x.h" define="N32G43X N32G435 USE_STDPERIPH_DRIVER"/>

<device Dname="N32G435G8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   16KB&#xA;&#xD;
- I/O:    24&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    14&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:1/1&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 0&#xA;&#xD;
- CAN:    0&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x2000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>


