pinpush-tech/ppbms-ce/boot/soc/n32g43x/eide/.pack/Nationstech/N32G43x_DFP.1.1.0/Nationstech.N32G43x_DFP.pdsc
<device Dname="N32G435GB">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   32KB&#xA;&#xD;
- I/O:    24&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    14&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:1/1&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 0&#xA;&#xD;
- CAN:    0&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x6000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>

				
<device Dname="N32G435K8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   16KB&#xA;&#xD;
- I/O:    26&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    14&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x2000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>


<device Dname="N32G435KB">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   32KB&#xA;&#xD;
- I/O:    26&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    14&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x6000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>

<device Dname="N32G435T8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   24KB&#xA;&#xD;
- I/O:    27&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x4000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>



<device Dname="N32G435C8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   24KB&#xA;&#xD;
- I/O:    38&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x4000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>


<device Dname="N32G435CB">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   32KB&#xA;&#xD;
- I/O:    38&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    1x12bit with 10 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x6000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>


<device Dname="N32G435R8">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  64KB&#xA;&#xD;
- SRAM:   24KB&#xA;&#xD;
- I/O:    52&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    28&#xA;&#xD;
- ADC:    1x12bit with 16 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x4000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x10000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>


<device Dname="N32G435RB">
    <description>
&#xA;&#xD;
- Package:&#xA;&#xD;
- Clock:  108MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   32KB&#xA;&#xD;
- I/O:    52&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  9&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    28&#xA;&#xD;
- ADC:    1x12bit with 16 channels&#xA;&#xD;
- DAC:    1x12-bit&#xA;&#xD;
- OPAMP:  2&#xA;&#xD;
- COMP:   2&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   2&#xA;&#xD;
- LPUART: 1&#xA;&#xD;
- SPI/I2S:2/2&#xA;&#xD;
- I2C:    2&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- DMA:    1*&#xA;&#xD;
- AES/T-DES/SHA/SM1/SM3/SM4/SM7
&#xA;&#xD;
    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x6000" default="1" init="0" />
	<memory id="IRAM2" access="rw" start="0x20006000" size="0x2000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G435.svd"/>
</device>

            </subFamily>
        </family>
    </devices>
        

    <conditions>
        <condition id="Compiler ARM">            <!-- conditions selecting ARM Compiler -->
            <require Tcompiler="ARMCC"/>
        </condition>

        <condition id="N32G43x CMSIS Device">            <!-- conditions selecting Devices -->
            <description>Nationstech N32G43x Series devices</description>
            <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
            <require Dvendor="Nationstech:184" Dname="N32*"/>
        </condition>

        <condition id="N32G43x STDPERIPH">
            <description>Nationstech N32G43x Standard Peripherals Drivers</description>
            <require condition="N32G43x CMSIS Device"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>

