pinpush-tech/ppbms-ce/boot/soc/n32g43x/eide/.pack/Nationstech/N32G43x_DFP.1.1.0/Nationstech.N32G43x_DFP.pdsc
        <condition id="N32G43x STDPERIPH RCC">
            <description>Nationstech N32G43x Standard Peripherals Drivers with RCC</description>
            <require condition="N32G43x STDPERIPH"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
        </condition>

        <condition id="N32G43x Algorithm Common" >
            <description>Nationstech N32G43x Series Algorithm Libraries Common Functions.</description>
            <require condition="N32G43x CMSIS Device"/>
            <require Cclass ="Device" Cgroup="Algorithm Libs" Csub="Common"/>
        </condition>

    </conditions>

    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G43x CMSIS Device">
            <description>Startup File for Nationstech N32G43x Series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="firmware/CMSIS/device/"/>
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g43x.s" attr="config" condition="N32G43x CMSIS Device" version="1.0.0"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="System_N32G43x" Cversion="1.0.0" condition="N32G43x CMSIS Device">
            <description>System Clock Config File for Nationstech N32G43x</description>
            <files>
                <!--  include folder -->
                <file category="include" name="firmware/CMSIS/device/"/>
                <file category="source" name="firmware/CMSIS/device/system_n32g43x.c" attr="config" version="1.0.0"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="N32G43x STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g43x_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/misc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_adc.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_adc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>Controller area network (CAN) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_can.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_can.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="COMP" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>Comparator (COMP) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_comp.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_comp.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>CRC calculation unit (CRC) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_crc.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_crc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>Digital-to-analog converter (DAC) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_dac.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_dac.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="MCUDBG" Cversion="1.0.0" condition="N32G43x STDPERIPH">
            <description>MCU debug component (MCUDBG) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_dbg.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_dbg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>DMA controller (DMA) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_dma.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_dma.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EXTI" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>External interrupt/event controller (EXTI) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_exti.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_exti.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FLASH" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_flash.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.0" condition="N32G43x STDPERIPH RCC">
            <description>General-purpose I/O (GPIO) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_gpio.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_gpio.c"/>
            </files>
        </component>

